upstream/OpenFOAM-v2606/modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsGQMOM/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
3000
(
1.24402271289e-08
6.62804708086e-09
3.9518141306e-09
2.7661339608e-09
2.33735132649e-09
2.37518098344e-09
2.79734865656e-09
3.62626983057e-09
...
)
;

boundaryField
{
    inlet1
    {
        type            calculated;
        value           uniform 6.88937e-08;
    }
    inlet2
    {
        type            calculated;
        value           uniform 6.88937e-08;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
7.11567976456e-09
5.89864285613e-09
4.95319956507e-09
4.21036191604e-09
3.62205364347e-09
3.15434267151e-09
2.78305587278e-09
2.49084345325e-09
...
)
;
    }
    walls
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
